{
  "projects": [
    {
      "title": "Todoist",
      "desktopImage": "todoist.png",
      "mobileImage": "todoist-mobile.png",
      "description": "A real time Todolist web app, allowing people to collaborate on todolists, with all members receiving live updates as changes are made. Built on NodeJS, Postgres, Angular and Websockets. Deployed to Heroku.",
      "siteLink": "http://todoist.montydawson.co.uk/",
      "moreInfo": "./work.html#todoist"
    },
    {
      "title": "Dublove",
      "desktopImage": "dublove.png",
      "mobileImage": "dublove-mobile.png",
      "description": "A fully functional responsive website, developed using the PHP CMS Silverstripe. I coded the theme from scratch, utilising a range of techniques to keep the site lightweight but also full of content.",
      "moreInfo": "./work.html#dublove"
    },
    {
      "title": "3 Minute Website",
      "desktopImage": "website.png",
      "mobileImage": "website-mobile.png",
      "description": "A small personal project to design a website that codes itself in real time - with the code being displayed to the user alongside the result. A fun exercise in modular JS.",
      "siteLink": "https://montydawson.co.uk/work/website-in-under-three/",
      "moreInfo": "./work.html#under-three"
    },
    {
      "title": "The Well Hopton",
      "desktopImage": "well.png",
      "mobileImage": "well-mobile.png",
      "description": "A responsive website designed for The Well Coffee Shop. HTML5, CSS3 and JavaScript designed from scratch, and hooked up to the PHP CMS, SilverStripe. Version control using git and github, and deployed to AWS.",
      "siteLink": "https://www.thewellhopton.org.uk/",
      "moreInfo": "./work.html#thewell"
    },
    {
      "title": "Slack Quiz Integration",
      "desktopImage": "slackquiz.png",
      "mobileImage": "slackquiz-mobile.png",
      "description": "A fun personal project that helped develop my backend skills. A quiz integration for Slack Teams that allows you to answer questions in slack and submit new questions and view stats using a small web app. Written in NodeJS and deployed to Heroku.",
      "moreInfo": "./work.html#slackquiz"
    }
  ]
}
